In [2]:
import pandas as pd

In [3]:
titanic_df = pd.read_csv('data/data-titanic.csv')

In [8]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic_df.shape

(891, 12)

In [5]:
proceso_minusculas = lambda x:x.lower()
proceso_minusculas_name_df = titanic_df.Name.apply(proceso_minusculas)

In [9]:
proceso_minusculas_name_df.head()

0                              braund, mr. owen harris
1    cumings, mrs. john bradley (florence briggs th...
2                               heikkinen, miss. laina
3         futrelle, mrs. jacques heath (lily may peel)
4                             allen, mr. william henry
Name: Name, dtype: object

In [10]:
multiplicar_por_10 = lambda x:x*10

In [12]:
titanic_df[['Age', 'Pclass']].apply(multiplicar_por_10).head()

     Age  Pclass
0  220.0      30
1  380.0      10
2  260.0      30
3  350.0      10
4  350.0      30

In [13]:
titanic_df[['Age', 'Pclass']].apply(lambda x:x**2).head()

      Age  Pclass
0   484.0       9
1  1444.0       1
2   676.0       9
3  1225.0       1
4  1225.0       9

In [14]:
import math

In [27]:
def cuadrado(valor):
    return math.pow(valor,2)

In [29]:
titanic_df['Age'].apply(cuadrado).head()

0     484.0
1    1444.0
2     676.0
3    1225.0
4    1225.0
Name: Age, dtype: float64

In [30]:
import numpy as np

In [38]:
titanic_df[['Age', 'Pclass']].apply(np.square).head()

      Age  Pclass
0   484.0       9
1  1444.0       1
2   676.0       9
3  1225.0       1
4  1225.0       9

In [37]:
titanic_df[['Age', 'Pclass']].applymap(np.square).head()

      Age  Pclass
0   484.0       9
1  1444.0       1
2   676.0       9
3  1225.0       1
4  1225.0       9

In [40]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [48]:
# Preguntas: 
# Cuantos pasajeros de tercera clase sobrevivieron en la catastrofe esta?
len(titanic_df[(titanic_df['Pclass'] == 3) & (titanic_df['Survived'] == 1)])

119

In [55]:
# Que edad tenia la persona mas joven que murio
int(titanic_df.sort_values(by=['Survived', 'Age'], ascending=[True, True]).head(1)['Age'])

1